# 파이썬으로 이메일을 보내려면 이메일을 설정해야 한다.

## 네이버 이메일 설정
## 네이버 메일 접속 > 내 메일함의 톱니바퀴(설정) 클릭 > POP3/IAMP 설정에서 IAMP/SMTP 설정으로 이동
## IMAP/SMTP 사용함 체크 후 확인 버튼 클릭

### IMAP: 휴대폰, 랩톱 및 태블릿과 같은 여러 다른 장치에서 전자 메일을
#         확인해야 하는 경우 권장되는 방법
#         - 사용하면 어디서나 모든 장치에서 전자메일을 엑세스 할 수 있다.
#         - 사용하여 전자 메일 메세지를 읽을 때 실제로 컴퓨터에 다운로드하거나 저장하지 않는다
#         - 클릭할 때만 메세지를 다운로드하고 첨부파일은 자동으로 다운로드되지 않아 
#           POP보다 메세지를 빠르게 확인할 수 있다.

### POP: 전자 메일 서비스에 문의하고 새 메세지를 모두 다운로드 하여 작동
#        PC 또는 Mac에 다운로드되면 전자 메일 서비스에서 삭제
#        --> 전자 메일을 다운로드한 후 동일 컴퓨터를 사용해야 접속 가능
#            다른 장치에서 전자 메일 접속 시 이전에 다운로드한 메세지 사용 불가
#        - 보낸 메일은 전자 메일 서버가 아닌 PC 또는 Mac에 로컬로 저장
#        - ISP(인터넷 서비스 공급자)는 POP를 사용하는 전자 메일 계정 제공

## 구글 이메일 설정
## Gmail에서 설정 > 모든 설정 보기
## 전달 및 POP/IMAP 탭에서 IMAP 사용 체크 후 변경사항 저장 버튼 클릭
## 자신의 구글 계정에서 Google 계정 관리 클릭 > 보안 > 로그인의 앱 비밀번호 클릭 > 비밀번호 입력 후 다음 클릭
## 메일, Windows 컴퓨터(Windows가 아닐 경우 기타) 선택 후 생성 버튼 클릭으로 생성 > 16자리의 비밀번호 생성